#Задание 4

print('Введите количество чисел: ')
N = int(input())

kol = 0

for i in range(N):
  
   print('Введите число: ')
   n = int(input()) 
   kol+=n 

print(kol)